<a href="https://colab.research.google.com/github/soundaryamurthyyy10/cold-water/blob/master/marketingcampaignforbankingproducts.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Marketing Campaign for Banking Products Project:

The file given contains data on 5000 customers. The data includes customer demographic information, the customer's relationship with the bank, the customer's response to the last personal loan campaign. The last year campaign for liability customers showed a conversion rate of 9% success.

Purpose of the model:

This model helps the bank to identify the potential customers who have a higher probability of purchasing the loan therefore increasing the success ratio while at the same time reducing the cost of the campaign.

Step 1 : Import the data sets and libraries required.

In [8]:
#importing libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [12]:
from google.colab import files
uploaded = files.upload()

Saving Bank_Personal_Loan_Modelling.csv to Bank_Personal_Loan_Modelling (1).csv

In [15]:
import io
dataset = pd.read_csv(io.BytesIO(uploaded['Bank_Personal_Loan_Modelling.csv']))

In [17]:
#To display the top 8 rows
dataset.head(8)

   ID  Age  Experience  ...  CD Account  Online  CreditCard
0   1   25           1  ...           0       0           0
1   2   45          19  ...           0       0           0
2   3   39          15  ...           0       0           0
3   4   35           9  ...           0       0           0
4   5   35           8  ...           0       0           1
5   6   37          13  ...           0       1           0
6   7   53          27  ...           0       1           0
7   8   50          24  ...           0       0           1

[8 rows x 14 columns]

In [18]:
#to check the bottom 8 rows
dataset. tail (8)

        ID  Age  Experience  ...  CD Account  Online  CreditCard
4992  4993   30           5  ...           0       0           0
4993  4994   45          21  ...           0       1           0
4994  4995   64          40  ...           0       1           0
4995  4996   29           3  ...           0       1           0
4996  4997   30           4  ...           0       1           0
4997  4998   63          39  ...           0       0           0
4998  4999   65          40  ...           0       1           0
4999  5000   28           4  ...           0       1           1

[8 rows x 14 columns]

The output column is personal loan. There are 12 other features:
● Age: Customer's age in completed years
● Experience: #years of professional experience
● Income: Annual income of the customer ($000)
● ZIP Code: Home Address ZIP code.
● Family: Family size of the customer
● CCAvg: Avg. spending on credit cards per month ($000)
● Education: Education Level. 1: Undergrad; 2: Graduate; 3: Advanced/ Professional
● Mortgage: Value of house mortgage if any. ($000)
● Personal Loan: Did this customer accept the personal loan offered in the last campaign?
● Securities Account: Does the customer have a securities account with the bank?
● CD Account: Does the customer have a certificate of deposit (CD) account with the bank?
● Online: Does the customer use internet banking facilities?
● Credit card: Does the customer use a credit card issued by the bank?

Checking the types of data and summary stats

In [22]:
dataset.shape

(5000, 14)

In [20]:
#to display datatype of eachcolumn and also display the non-null rows for each column
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   float64
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: float64(1), int64(13)
memory usage: 547.0 KB

In [21]:
#to display the summary stats which include count, mean,std, min,max etc.
dataset.describe()

                ID          Age  ...       Online   CreditCard
count  5000.000000  5000.000000  ...  5000.000000  5000.000000
mean   2500.500000    45.338400  ...     0.596800     0.294000
std    1443.520003    11.463166  ...     0.490589     0.455637
min       1.000000    23.000000  ...     0.000000     0.000000
25%    1250.750000    35.000000  ...     0.000000     0.000000
50%    2500.500000    45.000000  ...     1.000000     0.000000
75%    3750.250000    55.000000  ...     1.000000     1.000000
max    5000.000000    67.000000  ...     1.000000     1.000000

[8 rows x 14 columns]

In [23]:
#to display how many null valuesare present in each column
dataset.isnull().sum()

ID                    0
Age                   0
Experience            0
Income                0
ZIP Code              0
Family                0
CCAvg                 0
Education             0
Mortgage              0
Personal Loan         0
Securities Account    0
CD Account            0
Online                0
CreditCard            0
dtype: int64

Step 2: Removing irrevelant columns
We need to separate signal from noise. ID column which doesn't have any signal is dropped. Experience column(which has faulty data) is also dropped as it is highly correlated with the age.

In [24]:
experience = dataset ['Experience']
age = dataset ['Age']
correlation = experience.corr(age)
correlation

0.9942148569683321

In [26]:
dataset = dataset.drop(['ID','Experience'],axis=1 )
dataset.head(5)

   Age  Income  ZIP Code  ...  CD Account  Online  CreditCard
0   25      49     91107  ...           0       0           0
1   45      34     90089  ...           0       0           0
2   39      11     94720  ...           0       0           0
3   35     100     94112  ...           0       0           0
4   35      45     91330  ...           0       0           1

[5 rows x 12 columns]